In [1]:
import pandas as pd

# 1. Series

In [2]:
arr = pd.Series([1,2,3,4])
print arr

0    1
1    2
2    3
3    4
dtype: int64

In [19]:
arr2 = pd.Series([1,2,3,4], index=['a','b','c','d'], name='Value')
print arr2

a    1
b    2
c    3
d    4
Name: Value, dtype: int64

## operations

In [3]:
# vector operation
print arr + arr

# concat
arr2 = pd.concat((arr, arr), axis=0)

0    2
1    4
2    6
3    8
dtype: int64

## indexing/subsetting

In [4]:
arr = pd.Series([1,2,3,4], index=['a','b','c','d'])

print arr['b']  # select by index
print arr.loc['b']
print arr.iloc[0]  # select by number index

print arr[['a','d']]  # subset by indices
print arr.iloc[0:3]  # subset by number indices
print arr[[True, False, False, False]]  # subset by boolean
print arr[arr > 3]  # subset by condition

2
2
1
a    1
d    4
dtype: int64
a    1
b    2
c    3
dtype: int64
a    1
dtype: int64
d    4
dtype: int64

# 2. DataFrame

In [2]:
df = pd.read_csv('titanic_data.csv')

In [11]:
df[1:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [6]:
df2 = pd.DataFrame(df)
df3 = df.copy()

## api

In [7]:
df.describe()

C:\Users\smkim\Anaconda2\lib\site-packages\numpy\lib\function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,NaN,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,NaN,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,NaN,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# 3. Column operations

## column names

In [9]:
colNames = df.columns
print colNames

Index([u'PassengerId', u'Survived', u'Pclass', u'Name', u'Sex', u'Age',
       u'SibSp', u'Parch', u'Ticket', u'Fare', u'Cabin', u'Embarked'],
      dtype='object')

## select column

In [27]:
cols = df['Survived']
print cols.head()
print type(cols)

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64
<class 'pandas.core.series.Series'>

In [11]:
cols2 = df[colNames[0:3]]
print cols2.head()
print type(cols2)

   PassengerId  Survived  Pclass
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3
<class 'pandas.core.frame.DataFrame'>

## remove column

In [12]:
df.drop('Ticket', axis = 1);

## join columns

In [31]:
col = pd.Series(df['Age']*2, name='Age x2')
df = pd.concat([df, col], axis=1)
print df.head()

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked  Age x2  Age x2
0      0         A/5 21171   7.2500   NaN        S    44.0    44.0
1      0          PC 17599  71.2833   C85        C    76.0    76.0
2      0  STON/O2. 3101282   7.9250   NaN        S    52.0    52.0
3      0            113803  53.1000  C123        S    70.0    70.0
4      0            373450   8.0500   NaN        S    70.0    70.0

## select cells

In [96]:
df.iloc[0,3]

'Braund, Mr. Owen Harris'

# 4. Row operations

## select rows

In [64]:
df[0:1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [65]:
df[0:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [68]:
print df.loc[0]
print type(df.loc[0])

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object
<class 'pandas.core.series.Series'>

In [72]:
df.loc[0:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [71]:
df.iloc[0:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

## subsetting rows

In [85]:
df_survive = df[df['Survived'] == 1]
print df.shape
print df_survive.shape

(891, 12)
(342, 12)

## join rows

In [106]:
df2 = pd.concat([df.loc[0:3], df.loc[0:3]])
print df2['Name']

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
Name: Name, dtype: object